Autodesk.Revit.DB.FacetingUtils.ConvertTrianglesToQuads(Autodesk.Revit.DB.TriangulationInterface)
Replaces pairs of adjacent, coplanar triangles by quadrilaterals.
triangulation:
A triangulated face, shell, or solid.
Returns:
A collection of triangles and quadrilaterals representing the original triangulated object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation failed.
Since:
2013

Autodesk.Revit.DB.FacetingUtils
This class is used to convertTrianglesToQuads a triangulated structure into a structure in which some of the triangles
have been consolidated into quadrilaterals.
Since:
2013